# 데이터 처리가 쉬운 판다스
 - 링크: https://pandas.pydata.org/

# 2. 판다스 객체 생성

## (1) Series와 DataFrame

In [209]:
# 라이브러리 불러오기
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [78]:
# 정수형 데이터 Series 생성
score = pd.Series([95, 90, 85, 90, 95])
score

0    95
1    90
2    85
3    90
4    95
dtype: int64

In [79]:
# 실수형 데이터 Series 생성
s1 = pd.Series([4, 3.5, 3.8, 3, 3.7])
s1

0    4.0
1    3.5
2    3.8
3    3.0
4    3.7
dtype: float64

In [80]:
# 인덱스 지정하기
s2 = pd.Series([90, 80, 95], index=['A', 'B', 'C'])
s2

A    90
B    80
C    95
dtype: int64

In [81]:
## 인데스와 이름(Column Name)까지 지정하기
s3 = pd.Series([90, 80, 95], index=['A', 'B', 'C'], name="점수")
s3

A    90
B    80
C    95
Name: 점수, dtype: int64

In [84]:
# 넘파이로 배열생성하기
arr = np.arange(12).reshape(4,3)
df1 = pd.DataFrame(arr)
print(arr, '\n', df1)

[[ 0  1  2]
 [ 3  4  5]
 [ 6  7  8]
 [ 9 10 11]]
    0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [85]:
# 딕셔너리로 데이터프레임 생성하기
df2 = pd.DataFrame({'name':['장은실', '오경선', '양숙희'],
                    'score':[90, 80, 95],
                    'dept':['com', 'eng', 'math']})
df2

  name  score  dept
0  장은실     90   com
1  오경선     80   eng
2  양숙희     95  math

In [86]:
## 리스트로 데이터프레임 생성하기
list_data = [['장은실', 90, 'com'], ['오경선', 80, 'eng'], ['양숙희', 95, 'math']]
df3 = pd.DataFrame(list_data, columns=['name', 'score', 'dept'])
df3

  name  score  dept
0  장은실     90   com
1  오경선     80   eng
2  양숙희     95  math

In [87]:
# csv파일 불러오기
filename='./Data/mobile.csv'
df_rawdata_mobile = pd.read_csv(filename)
df_rawdata_mobile

     Brand   Color  price
0  Samsung   Black    100
1       LG    Gold     70
2    Apple  Silver    150
3    Apple    Gray    120

In [88]:
# csv파일 불러오기와 첫번째 컬럼을 인덱스로 지정하기
df_rawdata_mobile = pd.read_csv(filename, index_col=0)
df_rawdata_mobile

          Color  price
Brand
Samsung   Black    100
LG         Gold     70
Apple    Silver    150
Apple      Gray    120

# 3. 판다스 데이터 확인하기

In [89]:
filename='./Data/weather.csv'
df_rawdata_weather = pd.read_csv(filename)
df_rawdata_weather.info() # 데이터에 대한 전반적인 정보를 출력

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3653 entries, 0 to 3652
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       3653 non-null   object
 1   temp       3653 non-null   float64
 2   max_wind   3649 non-null   float64
 3   mean_wind  3647 non-null   float64
dtypes: float64(3), object(1)
memory usage: 114.3+ KB

In [90]:
df_rawdata_weather.shape # (행, 열) 크기 확인

(3653, 4)

In [91]:
df_rawdata_weather.head(10) # 데이터프레임의 첫 행 출력(Default 5개)

         date  temp  max_wind  mean_wind
0  2010-08-01  28.7       8.3        3.4
1  2010-08-02  25.2       8.7        3.8
2  2010-08-03  22.1       6.3        2.9
3  2010-08-04  25.3       6.6        4.2
4  2010-08-05  27.2       9.1        5.6
5  2010-08-06  26.8       9.8        8.0
6  2010-08-07  27.5       9.1        5.0
7  2010-08-08  26.6       5.9        4.0
8  2010-08-09  26.9       5.1        3.1
9  2010-08-10  25.6      10.2        5.5

In [92]:
df_rawdata_weather.tail(3) # 데이터프레임의 마지막 행 출력(Default 5개)

            date  temp  max_wind  mean_wind
3650  2020-07-29  21.6       3.2        1.0
3651  2020-07-30  22.9       9.7        2.4
3652  2020-07-31  25.7       4.8        2.5

In [93]:
df_rawdata_weather.index, df_rawdata_weather.columns

(RangeIndex(start=0, stop=3653, step=1),
 Index(['date', 'temp', 'max_wind', 'mean_wind'], dtype='object'))

In [94]:
df_rawdata_weather.describe() # Numerical 만 요약통계 생성 가능

              temp     max_wind    mean_wind
count  3653.000000  3649.000000  3647.000000
mean     12.942102     7.911099     3.936441
std       8.538507     3.029862     1.888473
min      -9.000000     2.000000     0.200000
25%       5.400000     5.700000     2.500000
50%      13.800000     7.600000     3.600000
75%      20.100000     9.700000     5.000000
max      31.300000    26.000000    14.900000

In [95]:
#기온(temp) 컬럼의 평균 출력하기
df_rawdata_weather['temp'].mean(), df_rawdata_weather.temp.mean()

(12.942102381604162, 12.942102381604162)

In [96]:
df_rawdata_weather.sort_values(by='max_wind')

            date  temp  max_wind  mean_wind
1514  2014-09-23  20.7       2.0        1.0
1134  2013-09-08  20.4       2.1        0.8
421   2011-09-26  18.7       2.1        0.3
1512  2014-09-21  20.4       2.2        1.2
1005  2013-05-02   7.1       2.2        0.8
...          ...   ...       ...        ...
2988  2018-10-06  19.4      26.0        7.0
559   2012-02-11  -0.7       NaN        NaN
560   2012-02-12   0.4       NaN        NaN
561   2012-02-13   4.0       NaN        NaN
3183  2019-04-19   7.8       NaN        2.3

[3653 rows x 4 columns]

In [97]:
df_rawdata_weather.sort_values(by='max_wind', ascending=False)

            date  temp  max_wind  mean_wind
2988  2018-10-06  19.4      26.0        7.0
3340  2019-09-23  15.0      25.8       11.0
1850  2015-08-25  20.1      25.3       14.9
3339  2019-09-22  15.7      23.1       11.9
1851  2015-08-26  17.4      22.6        8.1
...          ...   ...       ...        ...
1514  2014-09-23  20.7       2.0        1.0
559   2012-02-11  -0.7       NaN        NaN
560   2012-02-12   0.4       NaN        NaN
561   2012-02-13   4.0       NaN        NaN
3183  2019-04-19   7.8       NaN        2.3

[3653 rows x 4 columns]

In [98]:
filename='./Data/bank.csv'
df_rawdata_bank=pd.read_csv(filename)
df_rawdata_bank['job'].value_counts(), df_rawdata_bank['job'].value_counts(ascending=True)

(management       1560
 blue-collar      1499
 technician       1206
 admin.            834
 services          661
 retired           351
 self-employed     256
 entrepreneur      239
 unemployed        223
 housemaid         208
 student           153
 Name: job, dtype: int64,
 student           153
 housemaid         208
 unemployed        223
 entrepreneur      239
 self-employed     256
 retired           351
 services          661
 admin.            834
 technician       1206
 blue-collar      1499
 management       1560
 Name: job, dtype: int64)

In [99]:
df_rawdata_bank['job'].unique()

array(['management', 'technician', 'blue-collar', 'retired', 'services',
       'admin.', 'entrepreneur', 'self-employed', 'unemployed', 'student',
       nan, 'housemaid'], dtype=object)

# 4. 판다스 데이터 선택하기

## 열 선택하기

In [100]:
df_rawdata_weather['temp'] # df.temp
type(df_rawdata_weather['temp'])

pandas.core.series.Series

In [101]:
df_rawdata_weather[['date','temp']]

            date  temp
0     2010-08-01  28.7
1     2010-08-02  25.2
2     2010-08-03  22.1
3     2010-08-04  25.3
4     2010-08-05  27.2
...          ...   ...
3648  2020-07-27  22.1
3649  2020-07-28  21.9
3650  2020-07-29  21.6
3651  2020-07-30  22.9
3652  2020-07-31  25.7

[3653 rows x 2 columns]

In [102]:
df_rawdata_weather.loc[:,['date','temp']]

            date  temp
0     2010-08-01  28.7
1     2010-08-02  25.2
2     2010-08-03  22.1
3     2010-08-04  25.3
4     2010-08-05  27.2
...          ...   ...
3648  2020-07-27  22.1
3649  2020-07-28  21.9
3650  2020-07-29  21.6
3651  2020-07-30  22.9
3652  2020-07-31  25.7

[3653 rows x 2 columns]

In [103]:
df_rawdata_weather.iloc[:,[0,1]]

            date  temp
0     2010-08-01  28.7
1     2010-08-02  25.2
2     2010-08-03  22.1
3     2010-08-04  25.3
4     2010-08-05  27.2
...          ...   ...
3648  2020-07-27  22.1
3649  2020-07-28  21.9
3650  2020-07-29  21.6
3651  2020-07-30  22.9
3652  2020-07-31  25.7

[3653 rows x 2 columns]

## 행 선택하기

In [104]:
df_rawdata_weather[0:3]

         date  temp  max_wind  mean_wind
0  2010-08-01  28.7       8.3        3.4
1  2010-08-02  25.2       8.7        3.8
2  2010-08-03  22.1       6.3        2.9

In [106]:
# 인덱스를 date로 변경 후 행 선택하기
df_mod00_weather = df_rawdata_weather.copy()
df_mod00_weather.index=df_mod00_weather['date']
df_mod00_weather.loc['2010-08-01',['temp','mean_wind']]

temp         28.7
mean_wind     3.4
Name: 2010-08-01, dtype: object

In [109]:
df_rawdata_weather.iloc[3], df_mod00_weather.iloc[3] # Name이 다름(Index가 변경됨)

(date         2010-08-04
 temp               25.3
 max_wind            6.6
 mean_wind           4.2
 Name: 3, dtype: object,
 date         2010-08-04
 temp               25.3
 max_wind            6.6
 mean_wind           4.2
 Name: 2010-08-04, dtype: object)

In [111]:
df_rawdata_weather.iloc[1:3,0:2], df_mod00_weather.iloc[1:3,0:2]

(         date  temp
 1  2010-08-02  25.2
 2  2010-08-03  22.1,
                   date  temp
 date
 2010-08-02  2010-08-02  25.2
 2010-08-03  2010-08-03  22.1)

## 불 인덱싱(Boolean indexing)

In [126]:
# 해당 조건값에 대해 동일 길이의 Boolean Vector(True/False) 생성한다.
# Boolean 조건을 활용하야 원하는 index를 선택할 수 있다.
df_rawdata_weather['temp'] >= 30

0       False
1       False
2       False
3       False
4       False
        ...
3648    False
3649    False
3650    False
3651    False
3652    False
Name: temp, Length: 3653, dtype: bool

In [127]:
w = df_rawdata_weather['temp'] >= 30 
df_rawdata_weather[w]

            date  temp  max_wind  mean_wind
1103  2013-08-08  31.3       7.8        4.6
1104  2013-08-09  30.6       9.9        6.4
1105  2013-08-10  30.6       7.4        3.8
2913  2018-07-23  30.5       6.5        1.6
2925  2018-08-04  30.3       5.8        3.0

In [133]:
# Boolean Indexing을 별도의 변수 할당 없이 바로 적용 가능
df_rawdata_weather[df_rawdata_weather['temp'] >= 30]

            date  temp  max_wind  mean_wind
1103  2013-08-08  31.3       7.8        4.6
1104  2013-08-09  30.6       9.9        6.4
1105  2013-08-10  30.6       7.4        3.8
2913  2018-07-23  30.5       6.5        1.6
2925  2018-08-04  30.3       5.8        3.0

In [134]:
df_rawdata_weather[(df_rawdata_weather['temp']>=30) & (df_rawdata_weather['max_wind']>=9)]

            date  temp  max_wind  mean_wind
1104  2013-08-09  30.6       9.9        6.4

In [135]:
df_rawdata_weather[df_rawdata_weather['temp'] == df_rawdata_weather['temp'].max()]

            date  temp  max_wind  mean_wind
1103  2013-08-08  31.3       7.8        4.6

# 5. 판다스 결측 데이터 처리하기

In [132]:
df_rawdata_weather.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3653 entries, 0 to 3652
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       3653 non-null   object
 1   temp       3653 non-null   float64
 2   max_wind   3649 non-null   float64
 3   mean_wind  3647 non-null   float64
dtypes: float64(3), object(1)
memory usage: 114.3+ KB

In [152]:
# isna(=isnull)를 활용한 Boolean Indexing
df_rawdata_weather[(df_rawdata_weather['max_wind'].isna()) | (df_rawdata_weather['mean_wind'].isna())]

            date  temp  max_wind  mean_wind
559   2012-02-11  -0.7       NaN        NaN
560   2012-02-12   0.4       NaN        NaN
561   2012-02-13   4.0       NaN        NaN
1694  2015-03-22  10.1      11.6        NaN
1704  2015-04-01   7.3      12.1        NaN
3182  2019-04-18  15.7      11.7        NaN
3183  2019-04-19   7.8       NaN        2.3

In [137]:
# 결측데이터 컬럼별 확인
df_rawdata_weather.isnull().sum(), df_rawdata_weather.isna().sum()

(date         0
 temp         0
 max_wind     4
 mean_wind    6
 dtype: int64,
 date         0
 temp         0
 max_wind     4
 mean_wind    6
 dtype: int64)

In [140]:
# dropna를 사용하여 na값 모두 제거하기
df_mod01_weather = df_rawdata_weather.dropna()
df_mod01_weather.isnull().sum()

date         0
temp         0
max_wind     0
mean_wind    0
dtype: int64

In [154]:
# 결측 데이터를 평균값으로 대체하기 대체
df_mod02_weather = df_rawdata_weather.iloc[:,1:].fillna(df_rawdata_weather.iloc[:,1:].mean())
# 대체값 결과 비교하기
df_rawdata_weather[(df_rawdata_weather['max_wind'].isna()) | (df_rawdata_weather['mean_wind'].isna())], df_mod02_weather.iloc[list_na_idx,:]

(            date  temp  max_wind  mean_wind
 559   2012-02-11  -0.7       NaN        NaN
 560   2012-02-12   0.4       NaN        NaN
 561   2012-02-13   4.0       NaN        NaN
 1694  2015-03-22  10.1      11.6        NaN
 1704  2015-04-01   7.3      12.1        NaN
 3182  2019-04-18  15.7      11.7        NaN
 3183  2019-04-19   7.8       NaN        2.3,
       temp   max_wind  mean_wind
 559   -0.7   7.911099   3.936441
 560    0.4   7.911099   3.936441
 561    4.0   7.911099   3.936441
 1694  10.1  11.600000   3.936441
 1704   7.3  12.100000   3.936441
 3182  15.7  11.700000   3.936441
 3183   7.8   7.911099   2.300000)

In [155]:
df_mod02_weather.isnull().sum()

temp         0
max_wind     0
mean_wind    0
dtype: int64

# 6. 판다스 데이터 가공하기

In [158]:
filename='./Data/dust1.xlsx'
df_rawdata_dust=pd.read_excel(filename)
df_rawdata_dust.info()
df_rawdata_dust.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 12 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   지역      32 non-null     object
 1   망       32 non-null     object
 2   측정소코드   32 non-null     int64
 3   측정소명    32 non-null     object
 4   측정일시    32 non-null     int64
 5   SO2     32 non-null     float64
 6   CO      32 non-null     float64
 7   O3      32 non-null     float64
 8   NO2     32 non-null     float64
 9   PM10    32 non-null     int64
 10  PM25    32 non-null     int64
 11  주소      32 non-null     object
dtypes: float64(4), int64(4), object(4)
memory usage: 3.1+ KB

,지역,망,측정소코드,측정소명,측정일시,SO2,CO,O3,NO2,PM10,PM25,주소
0,서울 송파구,도시대기,111273,송파구,2021040101,0.004,1.0,0.002,0.066,50,18,서울 송파구 백제고분로 236
1,서울 송파구,도시대기,111273,송파구,2021040102,0.004,0.8,0.002,0.058,48,20,서울 송파구 백제고분로 236
2,서울 송파구,도시대기,111273,송파구,2021040103,0.004,0.8,0.002,0.055,44,20,서울 송파구 백제고분로 236
3,서울 송파구,도시대기,111273,송파구,2021040104,0.003,0.8,0.002,0.055,40,20,서울 송파구 백제고분로 236
4,서울 송파구,도시대기,111273,송파구,2021040105,0.004,0.8,0.002,0.053,38,17,서울 송파구 백제고분로 236

In [159]:
df_rawdata_dust.describe(include='all')

,지역,망,측정소코드,측정소명,측정일시,SO2,CO,O3,NO2,PM10,PM25,주소
count,32,32,32.0,32,3.200000e+01,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32
unique,1,1,NaN,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1
top,서울 송파구,도시대기,NaN,송파구,NaN,NaN,NaN,NaN,NaN,NaN,NaN,서울 송파구 백제고분로 236
freq,32,32,NaN,32,NaN,NaN,NaN,NaN,NaN,NaN,NaN,32
mean,NaN,NaN,111273.0,NaN,2.021040e+09,0.003125,0.468750,0.035625,0.026375,45.000000,13.656250,NaN
std,NaN,NaN,0.0,NaN,4.094686e+01,0.000554,0.208586,0.021480,0.018999,6.490688,4.012958,NaN
min,NaN,NaN,111273.0,NaN,2.021040e+09,0.002000,0.300000,0.002000,0.009000,38.000000,8.000000,NaN
25%,NaN,NaN,111273.0,NaN,2.021040e+09,0.003000,0.300000,0.011500,0.012000,41.750000,10.750000,NaN
50%,NaN,NaN,111273.0,NaN,2.021040e+09,0.003000,0.400000,0.046500,0.016500,44.000000,12.500000,NaN
75%,NaN,NaN,111273.0,NaN,2.021040e+09,0.003000,0.625000,0.050250,0.047250,46.000000,17.000000,NaN
max,NaN,NaN,111273.0,NaN,2.021040e+09,0.004000,1.000000,0.060000,0.066000,68.000000,22.000000,NaN

In [162]:
# 컬럼(변수) 삭제하기
## 위의 요약통계 확인 시 지역, 망, 측정소명 그리고 주소의 경우 unique값이 1개 즉 다 동일함.
## 측정소 코드의 경우 코드값으로 object여야 하나 int Type으로 되어 있고 mean, min, max가 다 동일함.
## 주소는 별도 처리를 위해 제외
df_mod00_dust = df_rawdata_dust.drop(['지역', '망', '측정소코드', '측정소명'], axis=1) # drop으로 제거
df_mod01_dust = df_rawdata_dust.iloc[:, 4:] # slicing으로 제거
df_mod00_dust.info(), df_mod01_dust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   측정일시    32 non-null     int64
 1   SO2     32 non-null     float64
 2   CO      32 non-null     float64
 3   O3      32 non-null     float64
 4   NO2     32 non-null     float64
 5   PM10    32 non-null     int64
 6   PM25    32 non-null     int64
 7   주소      32 non-null     object
dtypes: float64(4), int64(3), object(1)
memory usage: 2.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   측정일시    32 non-null     int64
 1   SO2     32 non-null     float64
 2   CO      32 non-null     float64
 3   O3      32 non-null     float64
 4   NO2     32 non-null     float64
 5   PM10    32 non-null     int64
 6   PM25    32 non-null     int64
 7   주소      32 non-null     object
dtypes: float64(4), int64(3), object(1)
memory usage: 2.1+ KB

(None, None)

In [164]:
df_mod00_dust.head()

         측정일시    SO2   CO     O3    NO2  PM10  PM25                주소
0  2021040101  0.004  1.0  0.002  0.066    50    18  서울 송파구 백제고분로 236
1  2021040102  0.004  0.8  0.002  0.058    48    20  서울 송파구 백제고분로 236
2  2021040103  0.004  0.8  0.002  0.055    44    20  서울 송파구 백제고분로 236
3  2021040104  0.003  0.8  0.002  0.055    40    20  서울 송파구 백제고분로 236
4  2021040105  0.004  0.8  0.002  0.053    38    17  서울 송파구 백제고분로 236

In [167]:
# 컬럼생성하기
df_mod00_dust['city'] = '서울' # 직접입력
df_mod01_dust['city'] = df_mod01_dust['주소'].str.slice(start=0, stop=2) # 주소 컬럼에서 가져오기

In [168]:
df_mod00_dust.head(), df_mod01_dust.head()

(         측정일시    SO2   CO     O3    NO2  PM10  PM25                주소 city
 0  2021040101  0.004  1.0  0.002  0.066    50    18  서울 송파구 백제고분로 236   서울
 1  2021040102  0.004  0.8  0.002  0.058    48    20  서울 송파구 백제고분로 236   서울
 2  2021040103  0.004  0.8  0.002  0.055    44    20  서울 송파구 백제고분로 236   서울
 3  2021040104  0.003  0.8  0.002  0.055    40    20  서울 송파구 백제고분로 236   서울
 4  2021040105  0.004  0.8  0.002  0.053    38    17  서울 송파구 백제고분로 236   서울,
          측정일시    SO2   CO     O3    NO2  PM10  PM25                주소 city
 0  2021040101  0.004  1.0  0.002  0.066    50    18  서울 송파구 백제고분로 236   서울
 1  2021040102  0.004  0.8  0.002  0.058    48    20  서울 송파구 백제고분로 236   서울
 2  2021040103  0.004  0.8  0.002  0.055    44    20  서울 송파구 백제고분로 236   서울
 3  2021040104  0.003  0.8  0.002  0.055    40    20  서울 송파구 백제고분로 236   서울
 4  2021040105  0.004  0.8  0.002  0.053    38    17  서울 송파구 백제고분로 236   서울)

In [169]:
df_mod01_dust.columns

Index(['측정일시', 'SO2', 'CO', 'O3', 'NO2', 'PM10', 'PM25', '주소', 'city'], dtype='object')

In [170]:
df_mod00_dust.rename(columns={'측정일시':'date', '주소':'addr'}, inplace=True)
df_mod01_dust.columns = ['date', 'SO2', 'CO', 'O3', 'NO2', 'PM10', 'PM25', 'addr', 'city']

In [171]:
df_mod00_dust.columns, df_mod01_dust.columns

(Index(['date', 'SO2', 'CO', 'O3', 'NO2', 'PM10', 'PM25', 'addr', 'city'], dtype='object'),
 Index(['date', 'SO2', 'CO', 'O3', 'NO2', 'PM10', 'PM25', 'addr', 'city'], dtype='object'))

In [173]:
df_mod00_dust.dtypes

date      int64
SO2     float64
CO      float64
O3      float64
NO2     float64
PM10      int64
PM25      int64
addr     object
city     object
dtype: object

In [176]:
# 숫자 int형을 문자열형으로 변환 후 연월일만 추출
df_mod00_dust['date'] = df_mod00_dust['date'].astype(str)
df_mod00_dust['date'] = df_mod00_dust['date'].str.slice(start=0, stop=8)
print(df_mod00_dust.dtypes)
df_mod00_dust.head()

date     object
SO2     float64
CO      float64
O3      float64
NO2     float64
PM10      int64
PM25      int64
addr     object
city     object
dtype: object

       date    SO2   CO     O3    NO2  PM10  PM25              addr city
0  20210401  0.004  1.0  0.002  0.066    50    18  서울 송파구 백제고분로 236   서울
1  20210401  0.004  0.8  0.002  0.058    48    20  서울 송파구 백제고분로 236   서울
2  20210401  0.004  0.8  0.002  0.055    44    20  서울 송파구 백제고분로 236   서울
3  20210401  0.003  0.8  0.002  0.055    40    20  서울 송파구 백제고분로 236   서울
4  20210401  0.004  0.8  0.002  0.053    38    17  서울 송파구 백제고분로 236   서울

In [177]:
df_mod00_dust['date'] = pd.to_datetime(df_mod00_dust['date'])
df_mod00_dust.dtypes

date    datetime64[ns]
SO2            float64
CO             float64
O3             float64
NO2            float64
PM10             int64
PM25             int64
addr            object
city            object
dtype: object

In [178]:
## Series dt를 활용한 연도, 월, 일 분리하여 컬럼으로 생성
df_mod00_dust['year'] = df_mod00_dust['date'].dt.year
df_mod00_dust['month'] = df_mod00_dust['date'].dt.month
df_mod00_dust['day'] = df_mod00_dust['date'].dt.day
df_mod00_dust.head()

,date,SO2,CO,O3,NO2,PM10,PM25,addr,city,year,month,day
0,2021-04-01,0.004,1.0,0.002,0.066,50,18,서울 송파구 백제고분로 236,서울,2021,4,1
1,2021-04-01,0.004,0.8,0.002,0.058,48,20,서울 송파구 백제고분로 236,서울,2021,4,1
2,2021-04-01,0.004,0.8,0.002,0.055,44,20,서울 송파구 백제고분로 236,서울,2021,4,1
3,2021-04-01,0.003,0.8,0.002,0.055,40,20,서울 송파구 백제고분로 236,서울,2021,4,1
4,2021-04-01,0.004,0.8,0.002,0.053,38,17,서울 송파구 백제고분로 236,서울,2021,4,1

## 데이터 병합(Merge)하기

In [179]:
filename='./Data/nation.xlsx'
df_rawdata_nation = pd.read_excel(filename)
df_rawdata_nation

  국적코드  성별    입국객수    증가수
0  A01  남성  125000   8000
1  A01  여성  130000  10000
2  A05  남성     300     10
3  A05  여성     200     50
4  A06  남성  158912  24486
5  A06  여성  325000  63466

In [180]:
filename='./Data/code.xlsx'
df_rawdata_code = pd.read_excel(filename)
df_rawdata_code

  국적코드  국적명
0  A01  필리핀
1  A02   일본
2  A03   미국
3  A04   중국
4  A05   호주
5  A06  베트남
6  A07  스위스
7  A99   기타

In [184]:
pd.merge(df_rawdata_nation, df_rawdata_code, on='국적코드'), df_rawdata_nation.merge(df_rawdata_code, how='left', on='국적코드')

(  국적코드  성별    입국객수    증가수  국적명
 0  A01  남성  125000   8000  필리핀
 1  A01  여성  130000  10000  필리핀
 2  A05  남성     300     10   호주
 3  A05  여성     200     50   호주
 4  A06  남성  158912  24486  베트남
 5  A06  여성  325000  63466  베트남,
   국적코드  성별    입국객수    증가수  국적명
 0  A01  남성  125000   8000  필리핀
 1  A01  여성  130000  10000  필리핀
 2  A05  남성     300     10   호주
 3  A05  여성     200     50   호주
 4  A06  남성  158912  24486  베트남
 5  A06  여성  325000  63466  베트남)

In [186]:
# 오른쪽 컬럼기준
pd.merge(df_rawdata_nation, df_rawdata_code, how='right',on='국적코드'), df_rawdata_nation.merge(df_rawdata_code, how='right', on='국적코드')

(   국적코드   성별      입국객수      증가수  국적명
 0   A01   남성  125000.0   8000.0  필리핀
 1   A01   여성  130000.0  10000.0  필리핀
 2   A02  NaN       NaN      NaN   일본
 3   A03  NaN       NaN      NaN   미국
 4   A04  NaN       NaN      NaN   중국
 5   A05   남성     300.0     10.0   호주
 6   A05   여성     200.0     50.0   호주
 7   A06   남성  158912.0  24486.0  베트남
 8   A06   여성  325000.0  63466.0  베트남
 9   A07  NaN       NaN      NaN  스위스
 10  A99  NaN       NaN      NaN   기타,
    국적코드   성별      입국객수      증가수  국적명
 0   A01   남성  125000.0   8000.0  필리핀
 1   A01   여성  130000.0  10000.0  필리핀
 2   A02  NaN       NaN      NaN   일본
 3   A03  NaN       NaN      NaN   미국
 4   A04  NaN       NaN      NaN   중국
 5   A05   남성     300.0     10.0   호주
 6   A05   여성     200.0     50.0   호주
 7   A06   남성  158912.0  24486.0  베트남
 8   A06   여성  325000.0  63466.0  베트남
 9   A07  NaN       NaN      NaN  스위스
 10  A99  NaN       NaN      NaN   기타)

# 4.7 판다스 데이터 그룹핑하기

In [190]:
filename='./Data/nation.xlsx'
df_rawdata_nation = pd.read_excel(filename)
df_rawdata_nation

  국적코드  성별    입국객수    증가수
0  A01  남성  125000   8000
1  A01  여성  130000  10000
2  A05  남성     300     10
3  A05  여성     200     50
4  A06  남성  158912  24486
5  A06  여성  325000  63466

In [203]:
# 국적코드별 입국객수 출력하기
df_rawdata_nation.groupby(by=['국적코드'])['입국객수'].sum()

국적코드
A01    255000
A05       500
A06    483912
Name: 입국객수, dtype: int64

In [204]:
# 국적코드별 입국객수, 증가수 모두 출력하기
df_rawdata_nation.groupby(by=['국적코드']).sum()

C:\Users\wisdo\AppData\Local\Temp\ipykernel_10320\2262213610.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df_rawdata_nation.groupby(by=['국적코드']).sum()

        입국객수    증가수
국적코드
A01   255000  18000
A05      500     60
A06   483912  87952

In [205]:
df_rawdata_nation.groupby(['국적코드','성별']).sum()

           입국객수    증가수
국적코드 성별
A01  남성  125000   8000
     여성  130000  10000
A05  남성     300     10
     여성     200     50
A06  남성  158912  24486
     여성  325000  63466

# 연습문제

In [240]:
# 문제1-1
filename = './Data/weather2.csv'
df_rawdata_weather2 = pd.read_csv(filename, encoding='cp949')
df_rawdata_weather2.info()
df_rawdata_weather2

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 273 entries, 0 to 272
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    273 non-null    object
 1   mean    273 non-null    float64
 2   low     273 non-null    float64
 3   high    273 non-null    float64
dtypes: float64(3), object(1)
memory usage: 8.7+ KB

           date  mean   low  high
0    2021-01-01  -4.2  -9.8   1.6
1    2021-01-02  -5.0  -8.4  -1.4
2    2021-01-03  -5.6  -9.1  -2.0
3    2021-01-04  -3.5  -8.4   0.3
4    2021-01-05  -5.5  -9.9  -2.1
..          ...   ...   ...   ...
268  2021-09-26  22.6  18.4  27.3
269  2021-09-27  21.6  18.7  25.0
270  2021-09-28  21.5  19.6  24.4
271  2021-09-29  20.2  17.8  21.4
272  2021-09-30  20.3  16.0  25.9

[273 rows x 4 columns]

In [239]:
# 문제1-2 : 태어난 날짜 2021년도 8월 16일
df_rawdata_weather2[df_rawdata_weather2['date'] == '2021-08-16']

           date  mean   low  high
227  2021-08-16  27.3  22.5  32.8

In [242]:
# 문제1-3 : 평균기온이 20도 이상인 날
df_rawdata_weather2[df_rawdata_weather2['mean'] >= 20]

           date  mean   low  high
111  2021-04-22  20.9  16.1  27.5
131  2021-05-12  22.0  16.9  27.7
132  2021-05-13  22.9  16.6  29.6
133  2021-05-14  24.1  18.0  30.8
134  2021-05-15  22.1  20.8  26.2
..          ...   ...   ...   ...
268  2021-09-26  22.6  18.4  27.3
269  2021-09-27  21.6  18.7  25.0
270  2021-09-28  21.5  19.6  24.4
271  2021-09-29  20.2  17.8  21.4
272  2021-09-30  20.3  16.0  25.9

[124 rows x 4 columns]

In [243]:
# 문제1-4 : 가장 무더웠던 날
df_rawdata_weather2[df_rawdata_weather2['high'] == df_rawdata_weather2['high'].max()]

           date  mean   low  high
204  2021-07-24  31.7  26.9  36.5

In [214]:
# 문제2
filename = './Data/covid.csv'
df_rawdata_covid = pd.read_csv(filename, encoding='cp949')
df_rawdata_covid

       항목  사례수    증가    감소  변화없음
0    스마트폰  999  78.9   1.7  19.4
1    텔레비전  965  68.5   3.9  27.6
2  개인용 PC  973  65.7   3.7  30.6
3  태블릿 PC  662  46.8   4.2  49.0
4     라디오  687  35.5  12.5  52.0
5    잡지·책  776  31.3  17.8  50.9
6    종이신문  552  17.6  23.2  59.2

In [215]:
# 문제2-1.항목열을 인덱스열로 지정한 후 ‘스마트폰’의 해당하는 모든 컬럼의 정보를 출력해보자.
df_rawdata_covid = pd.read_csv(filename, index_col=0, encoding='cp949')
df_rawdata_covid

        사례수    증가    감소  변화없음
항목
스마트폰    999  78.9   1.7  19.4
텔레비전    965  68.5   3.9  27.6
개인용 PC  973  65.7   3.7  30.6
태블릿 PC  662  46.8   4.2  49.0
라디오     687  35.5  12.5  52.0
잡지·책    776  31.3  17.8  50.9
종이신문    552  17.6  23.2  59.2

In [216]:
# 문제2-2.사례수가 가장 높은 항목의 모든 정보를 출력해보자.
result = df_rawdata_covid[df_rawdata_covid['사례수'] == df_rawdata_covid['사례수'].max()]
result

      사례수    증가   감소  변화없음
항목
스마트폰  999  78.9  1.7  19.4

In [217]:
# 문제2-3.증가율이 높은 3개의 항목을 출력해보자.
newdata = df_rawdata_covid.sort_values('증가', ascending=False)
newdata.head(3)

        사례수    증가   감소  변화없음
항목
스마트폰    999  78.9  1.7  19.4
텔레비전    965  68.5  3.9  27.6
개인용 PC  973  65.7  3.7  30.6

In [219]:
# 문제3-1
filename = './Data/vaccine.csv'
df_rawdata_vaccine = pd.read_csv(filename, encoding='cp949')
df_rawdata_vaccine

,date,subject,day1num,day1sum,day1rate,day2num,day2sum,day2rate
0,2021.10.16,9505868,10673,7562283,79.6,66910,6191341,65.1
1,2021.10.15,9505868,14556,7551829,79.4,133580,6124432,64.4
2,2021.10.14,9505868,9609,7536654,79.3,94569,5989111,63.0
3,2021.10.13,9505868,9804,7526430,79.2,77503,5893191,62.0
4,2021.10.12,9505868,17274,7516070,79.1,110204,5814018,61.2
...,...,...,...,...,...,...,...,...
174,2021.04.25,1023346,23323,350631,34.2,3411,18513,1.8
175,2021.04.24,1023346,200,350427,34.2,0,18513,1.8
176,2021.04.23,1027740,10195,345764,33.6,119,18376,1.8
177,2021.04.22,1023538,27074,317386,31.0,2479,15901,1.6
178,2021.04.21,1019322,22501,291857,28.6,2358,13543,1.3

In [226]:
# 문제3-2
# 필요없는 열을 삭제한다.
df_mod00_vaccine = df_rawdata_vaccine.drop(['day1sum', 'day1rate', 'day2sum', 'day2rate'], axis=1)
df_mod00_vaccine.info()
df_mod00_vaccine

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 179 entries, 0 to 178
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   date     179 non-null    object
 1   subject  179 non-null    int64
 2   day1num  179 non-null    int64
 3   day2num  179 non-null    int64
dtypes: int64(3), object(1)
memory usage: 5.7+ KB

           date  subject  day1num  day2num
0    2021.10.16  9505868    10673    66910
1    2021.10.15  9505868    14556   133580
2    2021.10.14  9505868     9609    94569
3    2021.10.13  9505868     9804    77503
4    2021.10.12  9505868    17274   110204
..          ...      ...      ...      ...
174  2021.04.25  1023346    23323     3411
175  2021.04.24  1023346      200        0
176  2021.04.23  1027740    10195      119
177  2021.04.22  1023538    27074     2479
178  2021.04.21  1019322    22501     2358

[179 rows x 4 columns]

In [224]:
# 문제3-3 : 기초통계량
df_mod00_vaccine.describe()

            subject        day1num        day2num
count  1.790000e+02     179.000000     179.000000
mean   5.086644e+06   40078.150838   34096.636872
std    3.324235e+06   44231.469656   40745.688278
min    1.019322e+06       0.000000       0.000000
25%    2.279241e+06    4385.000000    4794.500000
50%    3.943320e+06   23323.000000   16581.000000
75%    9.505868e+06   71634.500000   50950.000000
max    9.795426e+06  169036.000000  200186.000000

In [230]:
# 문제3-4 : 월별 평균값을 도출하기 위한 새로운 열 생성
df_mod00_vaccine['month'] = pd.DatetimeIndex(df_mod00_vaccine['date']).month
# df_mod00_vaccine['month'] = pd.to_datetime(df_mod00_vaccine['date']).dt.month
# df_mod00_vaccine['month'] = df_mod00_vaccine['date'].str.slice(start=5, stop=7)
df_mod00_vaccine

           date  subject  day1num  day2num  month
0    2021.10.16  9505868    10673    66910     10
1    2021.10.15  9505868    14556   133580     10
2    2021.10.14  9505868     9609    94569     10
3    2021.10.13  9505868     9804    77503     10
4    2021.10.12  9505868    17274   110204     10
..          ...      ...      ...      ...    ...
174  2021.04.25  1023346    23323     3411      4
175  2021.04.24  1023346      200        0      4
176  2021.04.23  1027740    10195      119      4
177  2021.04.22  1023538    27074     2479      4
178  2021.04.21  1019322    22501     2358      4

[179 rows x 5 columns]

In [231]:
# 문제3-4 : Groupby를 활용한 월별 평균값을 도출
df_month_means = df_mod00_vaccine.groupby('month').mean()
df_month_means

C:\Users\wisdo\AppData\Local\Temp\ipykernel_10320\2793819125.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df_month_means = df_mod00_vaccine.groupby('month').mean()

            subject       day1num       day2num
month
4      1.054686e+06  22060.100000   2304.600000
5      1.289918e+06  18225.548387   9734.000000
6      3.167106e+06  55957.200000  20147.300000
7      3.819340e+06  25807.870968   9934.903226
8      6.702049e+06  57667.258065  55575.000000
9      9.556825e+06  65715.000000  62162.000000
10     9.505868e+06   9406.312500  79900.750000

In [235]:
# 문제4
filename1 = './Data/signup.csv'
filename2 = './Data/professor.csv'
df_rawdata_signup = pd.read_csv(filename1, encoding='cp949')
df_rawdata_professor = pd.read_csv(filename2, encoding='cp949')
df_rawdata_signup, df_rawdata_professor

(   수강코드    과목명 담당교수
 0   111    파이썬  양숙희
 1   222  데이터분석  오경선
 2   333   인공지능  장은실
 3   444   선형대수  황복동
 4   555   이산수학  정명식
 5   666  컴퓨터개론  최봉수
 6   777   자료구조  김진영
 7   888   정보통신  김진호,
   담당교수     학과
 0  양숙희  컴퓨터공학
 1  장은실   정보통신
 2  오경선   인공지능
 3  황복동  컴퓨터공학
 4  정명식   인공지능)

In [236]:
# 문제4-1
df = pd.merge(df_rawdata_signup, df_rawdata_professor, on='담당교수')
# df = df_rawdata_signup.merge(df_rawdata_professor, how='left', on='담당교수')
df

   수강코드    과목명 담당교수     학과
0   111    파이썬  양숙희  컴퓨터공학
1   222  데이터분석  오경선   인공지능
2   333   인공지능  장은실   정보통신
3   444   선형대수  황복동  컴퓨터공학
4   555   이산수학  정명식   인공지능

In [237]:
# 문제4-1
df_rawdata_professor.groupby(['학과']).count()

       담당교수
학과
인공지능      2
정보통신      1
컴퓨터공학     2